package com.soltan.app.Sidebar;

import android.os.Bundle;

import androidx.core.text.HtmlCompat;
import androidx.fragment.app.Fragment;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;

import com.soltan.app.R;



public class InfoFragment extends Fragment {



    public InfoFragment() {
        // Required empty public constructor
    }


    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);

    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
        String str="هو العالم العامل الفقيه فضيلة الشيخ الأستاذ الدكتور محمد سيد سلطان عبد الرحيم أبو نبوت.\n" +
                "ولد - حفظه الله - بقرية بني عدى من قرى مركز منفلوط بمحافظة أسيوط يوم الثلاثاء 12 / 8 / 1958م .\n" +
                ".\n" +
                "<br/>\n" +
                "<br/>\n" +"المؤهلات العلمية :\n" +
                "<br/>\n" +"1- الإجازة العالية : ليسانس من كلية اللغة العربية بأسيوط – شعبة عامة بتقدير عام جيد جدا سنة 1981م .\n" +
                "<br/>\n" +"2- درجة التخصص \" الماجستير \" وعنوان الرسالة : المسائل البلاغية في تفسير ابن كمال باشا – من أول سورة الفرقان إلى آخر سورة الصافات – تحقيق ودراسة ، بتقدير \"جيد جدا \" من كلية اللغة العربية بالقاهرة سنة 1409 هـ 1989م .\n" +
                "<br/>\n" +"3- درجة العالمية \" الدكتوراه \" وعنوان الرسالة : علم البيان في تفسير روح البيان للإمام الشيخ / إسماعيل حقى البروسوى المتوفى سنة 1137هـ بتقدير مرتبة الشرف الأولى من كلية اللغة العربية في أسيوط سنة 1414هـ 1994م .\n" +
                "<br/>\n" +".\n" +
                "<br/>\n" +"\n" +
                "<br/>\n" +" التدرج الوظيفي :\n" +
                "<br/>\n" +"1- معيد في قسم البلاغة والنقد في كلية اللغة العربية جامعة الأزهر في أسيوط من 18 / 8 / 1982م\n" +
                "<br/>\n" +"2- مدرس مساعد في قسم البلاغة والنقد من 29 / 6 / 1989م .\n" +
                "<br/>\n" +"3- مدرس في قسم البلاغة والنقد بتاريخ 30 / 6 / 1994م .\n" +
                "<br/>\n" +"4- أستاذ مساعد في قسم البلاغة والنقد من 1 / 7 / 2013م .\n" +
                "<br/>\n" + "5- أستاذ في قسم البلاغة والنقد من 1 / 7 / 2018م .\n" +
                "<br/>\n" +".\n" +
                "<br/>\n" + "\n" +
                "<br/>\n" + "رابعا : الأبحاث العلمية التي تم نشرها :\n" +
                "<br/>\n" + "1- مباحث الإعجاز عند القاضي عياض في كتابه \"الشفا \" دراسة مقارنة\n" +
                "<br/>\n" +"بحث منشور في مجلة كلية اللغة العربية بأسيوط العدد رقم (29) لسنة 1431هـ 2010م .\n" +
                "<br/>\n" +"2- الاستعارة اللفظية عند الشيخ عبد القاهر .\n" +
                "<br/>\n" +"بحث منشور في مجلة كلية اللغة العربية بأسيوط العدد رقم (24) لسنة 2005م .\n" +
                "<br/>\n" +"3- سمت البلاغة بين مدرستي التحليل والتقعيد\n" +
                "<br/>\n" +"بحث منشور في مجلة كلية اللغة العربية بأسيوط العدد رقم (29)الجزء الثاني لسنة 1431هـ 2010م .\n" +
                "<br/>\n" +"4- خصائص التعبير وأساليبه البلاغية المطردة في حديث \" يا عبادي إني حرمت الظلم على نفسي \"\n" +
                "<br/>\n" + "بحث منشور في مجلة قطاع كليات اللغة العربية والشعب المناظرة لها – العدد رقم (6) لسنة 2011- 2012 – القاهرة .\n" +
                "<br/>\n" + "5- حذف الجواب لقيام ما يدل عليه مقامه في الذكر الحكيم في سياق خطابه – صلى الله عليه وسلم –\n" +
                "<br/>\n" +"بحث منشور في مجلة قطاع كليات اللغة العربية والشعب المناظرة لها – العدد (5) لسنة 2010م - 2011م – القاهرة .\n" +
                "<br/>\n" +"6- قصيدة المتنبي \" الرأي قبل شجاعة الشجعان \" دراسة بلاغية نقدية\n" +
                "<br/>\n" +"بحث مرجعي للترقية إلي درجة أستاذ مساعد – 1434هـ - 2013م\n" +
                "<br/>\n" +"7- منهج الإمام عبد القاهر في فقه آيات الصفات .\n" +
                "<br/>\n" + "بحث منشور في الجزء الثاني من مجلة المؤتمر العلمي الدولي الأول لكلية اللغة العربية بأسيوط تحت عنوان : الإمام عبد القاهر الجرجاني وجهوده في إثراء علوم اللغة العربية في شوال 1435 هـ - أغسطس 2014م .\n" +
                "<br/>\n" + "8- تجديد علم الإعجاز عند الشيخ الدكتور / محمد عبد الله دراز من خلال كتابه النبأ العظيم\n" +
                "<br/>\n" + "بحث منشور في مجلة المؤتمر العلمي الدولي الأول لفرع جامعة الأزهر بأسيوط تحت عنوان : \" الفهم الصحيح للتراث الإسلامي وأثره في علاج الانحراف الفكري 1437 هـ 2016م .\n" +
                "<br/>\n" + "9- تكرار الاسم معرفا ومنكرا بين السيوطي وبهاء الدين السبكي - عرض ونقد\n" +
                "<br/>\n" + "نشر في مجلة كلية البنات الإسلامية بأسيوط الجزء الثاني لعام 1437هـ 2016م العدد الخامس عشر .\n" +
                "<br/>\n" + "10- سنن العربية ميزان السداد والانحراف في تأويل النظم القرآني\n" +
                "<br/>\n" + "بحث منشور في مجلة المؤتمر العلمي الدولي الثاني لكلية اللغة العربية بأسيوط تحت عنوان : \" خصائص العربية في ضوء التاريخ والعلم\" 1438 هـ 2017م\n" +
                "<br/>\n" + "11- الاستعارة التمثيلية في الحكم العطائية بين الأنماط التعبيرية والبنى التركيبية\n" +
                "<br/>\n" + "بحث منشور في حولية كلية اللغة العربية بجرجا ( مجلة علمية محكمة ) العدد (21) الجزء الرابع - 1438 – 2017 م\n" +
                "<br/>\n" + ".\n" +
                "<br/>\n" + "\n" +
                "<br/>\n" + "الخبرات العلمية :\n" +
                "<br/>\n" + "شارك فضيلة أ.د/ محمد سيد سلطان في المؤتمرات العلمية الآتية :\n" +
                "<br/>\n" + "1- المؤتمر العلمي الدولي الأول لكلية اللغة العربية بأسيوط تحت عنوان :\" الإمام عبد القاهر الجرجاني وجهوده في إثراء علوم العربية في شوال 1435هـ - أغسطس 2014م .\n" +
                "<br/>\n" +"2- المؤتمر العلمي الدولي الأول لفرع جامعة الأزهر بأسيوط تحت عنوان :\" الفهم الصحيح للتراث الإسلامي وأثره في علاج الانحراف الفكري 1437 هـ 2016م .\n" +
                "<br/>\n" + "3- المؤتمر العلمي الدولي الثاني لكلية اللغة العربية بأسيوط تحت عنوان :\" خصائص العربية في ضوء التاريخ والعلم 1438 هـ - 2017م .\n" +
                "<br/>\n" + "الخبرات والأنشطة :\n" +
                "<br/>\n" + "1- في كلية اللغة العربية قام فضيلته بتدريس البلاغة والنقد والبحث البلاغي لمرحلة الليسانس في سنواتها المختلفة من سنة 1994 م إلي هذا التاريخ .\n" +
                "<br/>\n" +"2- كما قام فضيلته بالتدريس لطلاب الدراسات العالية – في السنة الأولى والثانية – مادة البلاغة والنقد- من وقت حصوله على درجة \" أستاذ مساعد \" في سنة 2013م .\n" +
                "<br/>\n" +"3- قام فضيلته بـتأليف الكتب الدراسية لطلاب الكلية ، وذلك بالاشتراك مع أساتذة القسم ، كما قام فضيلته بتأليف كتب ورسائل في العلوم المختلفة – من فقه مقارن وتصوف وأخلاق وفقه الأسرة والآداب الإسلامية وغير ذلك .\n" +
                "<br/>\n" + "4- كما يقوم فضيلته بالتدريس في الجامع الأزهر مادة الفقه المالكي من سنة 2007م حتى تاريخه .\n" +
                "<br/>\n" +"5- كما يقوم فضيلته بالتدريس لبعض الطلاب الوافدين مادة البلاغة والحديث النبوي وأصول الفقه المالكي .\n" +
                "<br/>\n" +".\n" +
                "<br/>\n" + "\n" +
                "<br/>\n" +"الكتب التى ألفها فضيلة الشيخ\n" +
                "<br/>\n" + "1- كشف اللثام عن تصوف المظلل بالغمام صلى الله عليه وسلم\n" +
                "<br/>\n" + "الناشر / دار جوامع الكلم الطبعة الأولى 1432هـ 2011م – رقم الإيداع 9594/ 2011/ الترقيم الدولى 9-116-977-978\n" +
                "<br/>\n" + "2- من فيض المنان في الدعوة إلي عباد الرحمن : يحتوى على مائة خطبة حديثة بالاشتراك مع آخرين – ط 1427 هـ 2006م مكتبة الإيمان – المنصورة رقم الإيداع 9632/2006م\n" +
                "<br/>\n" +"3- القول السديد في بناء البيت السعيد الطبعة الأولى 2009م\n" +
                "<br/>\n" + "4- منح الجليل بأحكام العليل تشتمل على بيان أحكام المرضى في الطهارة والصلاة والصيام والحج الطبعة الأولى 2010م\n" +
                "<br/>\n" + "5- إزالة الإلباس عن دماء الحيض والنفاس الطبعة الأولى 2011م\n" +
                "<br/>\n" +"6- الغنيمة والظفر بأحكام السفر وملحق به : الصيانة والحذر بأذكار السفر الطبعة الأولى 2012م\n" +
                "<br/>\n" +"7- شـفاء العليل بذكر الجليل - ومعه : غاية المنال بأذكار الموت والترحال 2013م\n" +
                "<br/>\n" +"8- المفتاح بأذكار الخطبة والنكاح ويليها إتحاف النبلاء بأذكار وأحكام الصبية والابناء الطبعة الأولى 2014م\n" +
                "<br/>\n" +"9- التحفة المرضية بأذكار وسنن وآداب اجتماعية الطبعة الأولى 2015م\n" +
                "<br/>\n" +"10- قطوف من أدب النبوة وسنن الرسول صلى الله عليه وسلم الطبعة الأولى 2016م\n" +
                "<br/>\n" +"11- قرة العين بأحكام العمرة وزيارة الحرمين الطبعة الأولى 2017م\n" +
                "<br/>\n" +"12- إرشاد العبد الأواه إلى بيان صفات وهيآت صلاة رسول الله صلى الله عليه وسلم الطبعة الأولى 2018م\n" +
                "<br/>\n" + "الكتب التي قام بتحقيقها :\n" +
                "<br/>\n" + "1- تحقيق كتاب \" نور الأبصار في مناقب آل بيت النبي المختار \" صلى الله عليه وسلم .\n" +
                "<br/>\n" +"للشيخ مؤمن بن حسن مؤمن الشبلنجى بالاشتراك مع آخرين – الناشر / دار جوامع الكلم بالقاهرة – 1428هـ 2007م – رقم الإيداع 24150/2007م – الترقيم الدولي 3-028-418-977\n" +
                "<br/>\n" + "2- تحقيق كتاب السيوف الصقال في رقبة من ينكر كرامات الأولياء بعد الانتقال – نشر دار جوامع الكلم – رقم الإيداع 13494/2014م – الترقيم الدولى 1-85-5259-977\n" +
                "<br/>\n" + "3- تحقيق كتاب إيضاح أسرار علوم المقربين للشيخ محمد بن عبد الله بن شيخ العيدروس نشر دار جوامع الكلم 1423هـ 2002م رقم الإيداع بدرا الكتب 14838 الترقيم الدولى 2-62-5259-977\n" +
                "<br/>\n" + "4- تحقيق \" الكبريت الأحمر والإكسير الأكبر في معرفة أسرار السلوك إلي ملك الملوك \" للشيخ العلامة عبد الله بن أبي بكر العيدروس – نشر دار جوامع الكلم – 1423هـ - 2003م .\n" +
                "<br/>\n" + "5- تحقيق كتاب :\" حياة القلوب في كيفية الوصول إلي المحبوب \" للعلامة الشيخ عماد الدين الأموي نشر دار جوامع الكلم – رقم الإيداع 14839 / 2002و .\n" +
                "<br/>\n" +"6- تحقيق كتاب :\" أسماء الله الحسنى والآيات الواردة فيها \" لفضيلة الشيخ حسنين مخلوف – مفتى الديار المصرية الأسبق – طبع ونشر مكتبة \"كشيدة\" رقم الإيداع بدار الكتب 16194/ 2011م .\n" +
                "<br/>\n" + "7- تحقيق كتاب \" الكواكب الزاهرة في اجتماع الأولياء يقظة بسيد الدنيا والآخرة – صلى الله عليه وسلم _ للشيخ العلامة أبي الفضل عبد القادر بن الحسين بن على الشهير بابن مغيزيل – بالاشتراك مع آخرين رقم الإيداع 15290 / 1999م\n" +
                "<br/>\n" + "8- تحقيق كتاب \" نفحات القرب والاتصال بإثبات التصرف لأولياء الله تعالى بعد الانتقال لشهاب الدين أحمد الحموي الحسيني ، ويليه فتويان في الموضوع نفسه للشيخين : محمد بخيت المطيعي ويوسف الدجوي- نشر دار جوامع الكلم – رقم الإيداع 14711 / 2003م\n" +
                "<br/>\n" + ".\n" +
                "<br/>\n" + "جدول الدروس العلمية لفضيلة أ.د/ محمد سيد سلطان :\n" +
                "<br/>\n" + "أولا : الدروس التي يلقيها بالمسجد الجعفري ببني عدى بعد صلاة العشاء :\n" +
                "<br/>\n" +"1- فتح الباري شرح صحيح البخاري لابن حجر العسقلاني ( يوم الاثنين – مرة كل أسبوعين )\n" +
                "<br/>\n" + "2- الشرح الصغير على متن أقرب المسالك إلى مذهب الإمام مالك لسيدي أحمد الدردير .\n" +
                "<br/>\n" + "(يوم الثلاثاء – مرة كل أسبوع )\n" +
                "<br/>\n" +"3- إحياء علوم الدين لحجة الإسلام الغزالي . (يوم الأربعاء – مرة كل أسبوع )\n" +
                "<br/>\n" + "4- الرسالة القشيرية لأبى القاسم القشيري . ( يوم الجمعة – مرة كل أسبوع )\n" +
                "<br/>\n" + "5- تفسير البغوي . (يوم السبت – مرة كل أسبوع )\n" +
                "<br/>\n" +"6- فقه النية من كتاب المدخل لابن الحاج المالكي (يوم الخميس – مرة كل أسبوعين )\n" +
                "<br/>\n" +"7- الإلهام النافع لكل قاصد لسيدي الشيخ صالح الجعفري على رسالة القواعد للسيد / أحمد بن إدريس رضي الله عنهما (يوم الجمعة - مرة كل شهر )\n" +
                "";

        View view=  inflater.inflate(R.layout.fragment_info, container, false);
        TextView htmlToTextView = view.findViewById(R.id.htmlToTextView);
        htmlToTextView.setText(HtmlCompat.fromHtml(str, 0));
        return view;
    }
}